#include "IDataIO.h"
#include <iostream>

//================================================================================
// コンストラクタ
IDataIO::IDataIO():
	FolderPath(""),
	FileName("")
{
}

//================================================================================
// コンストラクタ
IDataIO::IDataIO(const std::string& aPath)
{
}

//================================================================================
// コンストラクタ
IDataIO::IDataIO(const std::string& aFolder , const std::string& aFileName):
	FolderPath(aFolder),
	FileName(aFileName)
{
}

//================================================================================
// デストラクタ
IDataIO::~IDataIO()
{
	Close();
}

//================================================================================
// ファイルを開く
void IDataIO::Open()
{
}

//================================================================================
// ファイルを開いているか
bool IDataIO::IsOpen()const
{
	return false;
}

//================================================================================
// ファイルを閉じる
void IDataIO::Close()
{
}

//================================================================================
// データの読み書き
void IDataIO::ReadWrite( void* ptr , size_t size )
{
}




